Tekla Open API Reference for Tekla Structures 2025
PolycurveGeometryBuilder.AppendTangentArc Method
 Appends an arc tangent to the last curve of the curve list.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PolycurveGeometryBuilder AppendTangentArc(
	Point endPoint
)
Public Function AppendTangentArc (
	endPoint As Point
) As PolycurveGeometryBuilder
Parameters
endPoint
Type: Tekla.Structures.Geometry3d.Point
End point of the arc
Return Value
Type: PolycurveGeometryBuilder
The builder itself
Remarks
 This function requires that there is at least one curve in the polycurve
See Also
Reference
PolycurveGeometryBuilder Class
Tekla.Structures.Geometry3d Namespace